GopalSaraf/Practicals/PSDL/include/proc/pic16f785.inc
// Register: OSCCON
#define OSCCON OSCCON
OSCCON                                   equ 008Fh
// bitfield definitions
OSCCON_SCS_POSN                          equ 0000h
OSCCON_SCS_POSITION                      equ 0000h
OSCCON_SCS_SIZE                          equ 0001h
OSCCON_SCS_LENGTH                        equ 0001h
OSCCON_SCS_MASK                          equ 0001h
OSCCON_LTS_POSN                          equ 0001h
OSCCON_LTS_POSITION                      equ 0001h
OSCCON_LTS_SIZE                          equ 0001h
OSCCON_LTS_LENGTH                        equ 0001h
OSCCON_LTS_MASK                          equ 0002h
OSCCON_HTS_POSN                          equ 0002h
OSCCON_HTS_POSITION                      equ 0002h
OSCCON_HTS_SIZE                          equ 0001h
OSCCON_HTS_LENGTH                        equ 0001h
OSCCON_HTS_MASK                          equ 0004h
OSCCON_OSTS_POSN                         equ 0003h
OSCCON_OSTS_POSITION                     equ 0003h
OSCCON_OSTS_SIZE                         equ 0001h
OSCCON_OSTS_LENGTH                       equ 0001h
OSCCON_OSTS_MASK                         equ 0008h
OSCCON_IRCF_POSN                         equ 0004h
OSCCON_IRCF_POSITION                     equ 0004h
OSCCON_IRCF_SIZE                         equ 0003h
OSCCON_IRCF_LENGTH                       equ 0003h
OSCCON_IRCF_MASK                         equ 0070h
OSCCON_IRCF0_POSN                        equ 0004h
OSCCON_IRCF0_POSITION                    equ 0004h
OSCCON_IRCF0_SIZE                        equ 0001h
OSCCON_IRCF0_LENGTH                      equ 0001h
OSCCON_IRCF0_MASK                        equ 0010h
OSCCON_IRCF1_POSN                        equ 0005h
OSCCON_IRCF1_POSITION                    equ 0005h
OSCCON_IRCF1_SIZE                        equ 0001h
OSCCON_IRCF1_LENGTH                      equ 0001h
OSCCON_IRCF1_MASK                        equ 0020h
OSCCON_IRCF2_POSN                        equ 0006h
OSCCON_IRCF2_POSITION                    equ 0006h
OSCCON_IRCF2_SIZE                        equ 0001h
OSCCON_IRCF2_LENGTH                      equ 0001h
OSCCON_IRCF2_MASK                        equ 0040h

// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0090h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: ANSEL0
#define ANSEL0 ANSEL0
ANSEL0                                   equ 0091h
// bitfield definitions
ANSEL0_ANS0_POSN                         equ 0000h
ANSEL0_ANS0_POSITION                     equ 0000h
ANSEL0_ANS0_SIZE                         equ 0001h
ANSEL0_ANS0_LENGTH                       equ 0001h
ANSEL0_ANS0_MASK                         equ 0001h
ANSEL0_ANS1_POSN                         equ 0001h
ANSEL0_ANS1_POSITION                     equ 0001h
ANSEL0_ANS1_SIZE                         equ 0001h
ANSEL0_ANS1_LENGTH                       equ 0001h
ANSEL0_ANS1_MASK                         equ 0002h
ANSEL0_ANS2_POSN                         equ 0002h
ANSEL0_ANS2_POSITION                     equ 0002h
ANSEL0_ANS2_SIZE                         equ 0001h
ANSEL0_ANS2_LENGTH                       equ 0001h
ANSEL0_ANS2_MASK                         equ 0004h
ANSEL0_ANS3_POSN                         equ 0003h
ANSEL0_ANS3_POSITION                     equ 0003h
ANSEL0_ANS3_SIZE                         equ 0001h
ANSEL0_ANS3_LENGTH                       equ 0001h
ANSEL0_ANS3_MASK                         equ 0008h
ANSEL0_ANS4_POSN                         equ 0004h
ANSEL0_ANS4_POSITION                     equ 0004h
ANSEL0_ANS4_SIZE                         equ 0001h
ANSEL0_ANS4_LENGTH                       equ 0001h
ANSEL0_ANS4_MASK                         equ 0010h
ANSEL0_ANS5_POSN                         equ 0005h
ANSEL0_ANS5_POSITION                     equ 0005h
ANSEL0_ANS5_SIZE                         equ 0001h
ANSEL0_ANS5_LENGTH                       equ 0001h
ANSEL0_ANS5_MASK                         equ 0020h
ANSEL0_ANS6_POSN                         equ 0006h
ANSEL0_ANS6_POSITION                     equ 0006h
ANSEL0_ANS6_SIZE                         equ 0001h
ANSEL0_ANS6_LENGTH                       equ 0001h
ANSEL0_ANS6_MASK                         equ 0040h
ANSEL0_ANS7_POSN                         equ 0007h
ANSEL0_ANS7_POSITION                     equ 0007h
ANSEL0_ANS7_SIZE                         equ 0001h
ANSEL0_ANS7_LENGTH                       equ 0001h
ANSEL0_ANS7_MASK                         equ 0080h

// Register: PR2
#define PR2 PR2
PR2                                      equ 0092h

// Register: ANSEL1
#define ANSEL1 ANSEL1
ANSEL1                                   equ 0093h
// bitfield definitions
ANSEL1_ANS8_POSN                         equ 0000h
ANSEL1_ANS8_POSITION                     equ 0000h
ANSEL1_ANS8_SIZE                         equ 0001h
ANSEL1_ANS8_LENGTH                       equ 0001h
ANSEL1_ANS8_MASK                         equ 0001h
ANSEL1_ANS9_POSN                         equ 0001h
ANSEL1_ANS9_POSITION                     equ 0001h
ANSEL1_ANS9_SIZE                         equ 0001h
ANSEL1_ANS9_LENGTH                       equ 0001h
ANSEL1_ANS9_MASK                         equ 0002h
ANSEL1_ANS10_POSN                        equ 0002h
ANSEL1_ANS10_POSITION                    equ 0002h
ANSEL1_ANS10_SIZE                        equ 0001h
ANSEL1_ANS10_LENGTH                      equ 0001h
ANSEL1_ANS10_MASK                        equ 0004h
ANSEL1_ANS11_POSN                        equ 0003h
ANSEL1_ANS11_POSITION                    equ 0003h
ANSEL1_ANS11_SIZE                        equ 0001h
ANSEL1_ANS11_LENGTH                      equ 0001h
ANSEL1_ANS11_MASK                        equ 0008h

