GopalSaraf/Practicals/PSDL/include/proc/pic16f785.inc
// Register: WPUA
#define WPUA WPUA
WPUA                                     equ 0095h
// bitfield definitions
WPUA_WPUA0_POSN                          equ 0000h
WPUA_WPUA0_POSITION                      equ 0000h
WPUA_WPUA0_SIZE                          equ 0001h
WPUA_WPUA0_LENGTH                        equ 0001h
WPUA_WPUA0_MASK                          equ 0001h
WPUA_WPUA1_POSN                          equ 0001h
WPUA_WPUA1_POSITION                      equ 0001h
WPUA_WPUA1_SIZE                          equ 0001h
WPUA_WPUA1_LENGTH                        equ 0001h
WPUA_WPUA1_MASK                          equ 0002h
WPUA_WPUA2_POSN                          equ 0002h
WPUA_WPUA2_POSITION                      equ 0002h
WPUA_WPUA2_SIZE                          equ 0001h
WPUA_WPUA2_LENGTH                        equ 0001h
WPUA_WPUA2_MASK                          equ 0004h
WPUA_WPUA3_POSN                          equ 0003h
WPUA_WPUA3_POSITION                      equ 0003h
WPUA_WPUA3_SIZE                          equ 0001h
WPUA_WPUA3_LENGTH                        equ 0001h
WPUA_WPUA3_MASK                          equ 0008h
WPUA_WPUA4_POSN                          equ 0004h
WPUA_WPUA4_POSITION                      equ 0004h
WPUA_WPUA4_SIZE                          equ 0001h
WPUA_WPUA4_LENGTH                        equ 0001h
WPUA_WPUA4_MASK                          equ 0010h
WPUA_WPUA5_POSN                          equ 0005h
WPUA_WPUA5_POSITION                      equ 0005h
WPUA_WPUA5_SIZE                          equ 0001h
WPUA_WPUA5_LENGTH                        equ 0001h
WPUA_WPUA5_MASK                          equ 0020h
WPUA_WPU0_POSN                           equ 0000h
WPUA_WPU0_POSITION                       equ 0000h
WPUA_WPU0_SIZE                           equ 0001h
WPUA_WPU0_LENGTH                         equ 0001h
WPUA_WPU0_MASK                           equ 0001h
WPUA_WPU1_POSN                           equ 0001h
WPUA_WPU1_POSITION                       equ 0001h
WPUA_WPU1_SIZE                           equ 0001h
WPUA_WPU1_LENGTH                         equ 0001h
WPUA_WPU1_MASK                           equ 0002h
WPUA_WPU2_POSN                           equ 0002h
WPUA_WPU2_POSITION                       equ 0002h
WPUA_WPU2_SIZE                           equ 0001h
WPUA_WPU2_LENGTH                         equ 0001h
WPUA_WPU2_MASK                           equ 0004h
WPUA_WPU3_POSN                           equ 0003h
WPUA_WPU3_POSITION                       equ 0003h
WPUA_WPU3_SIZE                           equ 0001h
WPUA_WPU3_LENGTH                         equ 0001h
WPUA_WPU3_MASK                           equ 0008h
WPUA_WPU4_POSN                           equ 0004h
WPUA_WPU4_POSITION                       equ 0004h
WPUA_WPU4_SIZE                           equ 0001h
WPUA_WPU4_LENGTH                         equ 0001h
WPUA_WPU4_MASK                           equ 0010h
WPUA_WPU5_POSN                           equ 0005h
WPUA_WPU5_POSITION                       equ 0005h
WPUA_WPU5_SIZE                           equ 0001h
WPUA_WPU5_LENGTH                         equ 0001h
WPUA_WPU5_MASK                           equ 0020h

// Register: IOCA
#define IOCA IOCA
IOCA                                     equ 0096h
// bitfield definitions
IOCA_IOCA0_POSN                          equ 0000h
IOCA_IOCA0_POSITION                      equ 0000h
IOCA_IOCA0_SIZE                          equ 0001h
IOCA_IOCA0_LENGTH                        equ 0001h
IOCA_IOCA0_MASK                          equ 0001h
IOCA_IOCA1_POSN                          equ 0001h
IOCA_IOCA1_POSITION                      equ 0001h
IOCA_IOCA1_SIZE                          equ 0001h
IOCA_IOCA1_LENGTH                        equ 0001h
IOCA_IOCA1_MASK                          equ 0002h
IOCA_IOCA2_POSN                          equ 0002h
IOCA_IOCA2_POSITION                      equ 0002h
IOCA_IOCA2_SIZE                          equ 0001h
IOCA_IOCA2_LENGTH                        equ 0001h
IOCA_IOCA2_MASK                          equ 0004h
IOCA_IOCA3_POSN                          equ 0003h
IOCA_IOCA3_POSITION                      equ 0003h
IOCA_IOCA3_SIZE                          equ 0001h
IOCA_IOCA3_LENGTH                        equ 0001h
IOCA_IOCA3_MASK                          equ 0008h
IOCA_IOCA4_POSN                          equ 0004h
IOCA_IOCA4_POSITION                      equ 0004h
IOCA_IOCA4_SIZE                          equ 0001h
IOCA_IOCA4_LENGTH                        equ 0001h
IOCA_IOCA4_MASK                          equ 0010h
IOCA_IOCA5_POSN                          equ 0005h
IOCA_IOCA5_POSITION                      equ 0005h
IOCA_IOCA5_SIZE                          equ 0001h
IOCA_IOCA5_LENGTH                        equ 0001h
IOCA_IOCA5_MASK                          equ 0020h
IOCA_IOC0_POSN                           equ 0000h
IOCA_IOC0_POSITION                       equ 0000h
IOCA_IOC0_SIZE                           equ 0001h
IOCA_IOC0_LENGTH                         equ 0001h
IOCA_IOC0_MASK                           equ 0001h
IOCA_IOC1_POSN                           equ 0001h
IOCA_IOC1_POSITION                       equ 0001h
IOCA_IOC1_SIZE                           equ 0001h
IOCA_IOC1_LENGTH                         equ 0001h
IOCA_IOC1_MASK                           equ 0002h
IOCA_IOC2_POSN                           equ 0002h
IOCA_IOC2_POSITION                       equ 0002h
IOCA_IOC2_SIZE                           equ 0001h
IOCA_IOC2_LENGTH                         equ 0001h
IOCA_IOC2_MASK                           equ 0004h
IOCA_IOC3_POSN                           equ 0003h
IOCA_IOC3_POSITION                       equ 0003h
IOCA_IOC3_SIZE                           equ 0001h
IOCA_IOC3_LENGTH                         equ 0001h
IOCA_IOC3_MASK                           equ 0008h
IOCA_IOC4_POSN                           equ 0004h
IOCA_IOC4_POSITION                       equ 0004h
IOCA_IOC4_SIZE                           equ 0001h
IOCA_IOC4_LENGTH                         equ 0001h
IOCA_IOC4_MASK                           equ 0010h
IOCA_IOC5_POSN                           equ 0005h
IOCA_IOC5_POSITION                       equ 0005h
IOCA_IOC5_SIZE                           equ 0001h
IOCA_IOC5_LENGTH                         equ 0001h
IOCA_IOC5_MASK                           equ 0020h

