GopalSaraf/Practicals/PSDL/include/proc/pic16f785.inc
// Register: PWMCLK
#define PWMCLK PWMCLK
PWMCLK                                   equ 0112h
// bitfield definitions
PWMCLK_PER_POSN                          equ 0000h
PWMCLK_PER_POSITION                      equ 0000h
PWMCLK_PER_SIZE                          equ 0005h
PWMCLK_PER_LENGTH                        equ 0005h
PWMCLK_PER_MASK                          equ 001Fh
PWMCLK_PWMP_POSN                         equ 0005h
PWMCLK_PWMP_POSITION                     equ 0005h
PWMCLK_PWMP_SIZE                         equ 0002h
PWMCLK_PWMP_LENGTH                       equ 0002h
PWMCLK_PWMP_MASK                         equ 0060h
PWMCLK_PWMASE_POSN                       equ 0007h
PWMCLK_PWMASE_POSITION                   equ 0007h
PWMCLK_PWMASE_SIZE                       equ 0001h
PWMCLK_PWMASE_LENGTH                     equ 0001h
PWMCLK_PWMASE_MASK                       equ 0080h
PWMCLK_PER0_POSN                         equ 0000h
PWMCLK_PER0_POSITION                     equ 0000h
PWMCLK_PER0_SIZE                         equ 0001h
PWMCLK_PER0_LENGTH                       equ 0001h
PWMCLK_PER0_MASK                         equ 0001h
PWMCLK_PER1_POSN                         equ 0001h
PWMCLK_PER1_POSITION                     equ 0001h
PWMCLK_PER1_SIZE                         equ 0001h
PWMCLK_PER1_LENGTH                       equ 0001h
PWMCLK_PER1_MASK                         equ 0002h
PWMCLK_PER2_POSN                         equ 0002h
PWMCLK_PER2_POSITION                     equ 0002h
PWMCLK_PER2_SIZE                         equ 0001h
PWMCLK_PER2_LENGTH                       equ 0001h
PWMCLK_PER2_MASK                         equ 0004h
PWMCLK_PER3_POSN                         equ 0003h
PWMCLK_PER3_POSITION                     equ 0003h
PWMCLK_PER3_SIZE                         equ 0001h
PWMCLK_PER3_LENGTH                       equ 0001h
PWMCLK_PER3_MASK                         equ 0008h
PWMCLK_PER4_POSN                         equ 0004h
PWMCLK_PER4_POSITION                     equ 0004h
PWMCLK_PER4_SIZE                         equ 0001h
PWMCLK_PER4_LENGTH                       equ 0001h
PWMCLK_PER4_MASK                         equ 0010h
PWMCLK_PWMP0_POSN                        equ 0005h
PWMCLK_PWMP0_POSITION                    equ 0005h
PWMCLK_PWMP0_SIZE                        equ 0001h
PWMCLK_PWMP0_LENGTH                      equ 0001h
PWMCLK_PWMP0_MASK                        equ 0020h
PWMCLK_PWMP1_POSN                        equ 0006h
PWMCLK_PWMP1_POSITION                    equ 0006h
PWMCLK_PWMP1_SIZE                        equ 0001h
PWMCLK_PWMP1_LENGTH                      equ 0001h
PWMCLK_PWMP1_MASK                        equ 0040h

// Register: PWMPH1
#define PWMPH1 PWMPH1
PWMPH1                                   equ 0113h
// bitfield definitions
PWMPH1_PH_POSN                           equ 0000h
PWMPH1_PH_POSITION                       equ 0000h
PWMPH1_PH_SIZE                           equ 0005h
PWMPH1_PH_LENGTH                         equ 0005h
PWMPH1_PH_MASK                           equ 001Fh
PWMPH1_C1EN_POSN                         equ 0005h
PWMPH1_C1EN_POSITION                     equ 0005h
PWMPH1_C1EN_SIZE                         equ 0001h
PWMPH1_C1EN_LENGTH                       equ 0001h
PWMPH1_C1EN_MASK                         equ 0020h
PWMPH1_C2EN_POSN                         equ 0006h
PWMPH1_C2EN_POSITION                     equ 0006h
PWMPH1_C2EN_SIZE                         equ 0001h
PWMPH1_C2EN_LENGTH                       equ 0001h
PWMPH1_C2EN_MASK                         equ 0040h
PWMPH1_POL_POSN                          equ 0007h
PWMPH1_POL_POSITION                      equ 0007h
PWMPH1_POL_SIZE                          equ 0001h
PWMPH1_POL_LENGTH                        equ 0001h
PWMPH1_POL_MASK                          equ 0080h
PWMPH1_PH0_POSN                          equ 0000h
PWMPH1_PH0_POSITION                      equ 0000h
PWMPH1_PH0_SIZE                          equ 0001h
PWMPH1_PH0_LENGTH                        equ 0001h
PWMPH1_PH0_MASK                          equ 0001h
PWMPH1_PH1_POSN                          equ 0001h
PWMPH1_PH1_POSITION                      equ 0001h
PWMPH1_PH1_SIZE                          equ 0001h
PWMPH1_PH1_LENGTH                        equ 0001h
PWMPH1_PH1_MASK                          equ 0002h
PWMPH1_PH2_POSN                          equ 0002h
PWMPH1_PH2_POSITION                      equ 0002h
PWMPH1_PH2_SIZE                          equ 0001h
PWMPH1_PH2_LENGTH                        equ 0001h
PWMPH1_PH2_MASK                          equ 0004h
PWMPH1_PH3_POSN                          equ 0003h
PWMPH1_PH3_POSITION                      equ 0003h
PWMPH1_PH3_SIZE                          equ 0001h
PWMPH1_PH3_LENGTH                        equ 0001h
PWMPH1_PH3_MASK                          equ 0008h
PWMPH1_PH4_POSN                          equ 0004h
PWMPH1_PH4_POSITION                      equ 0004h
PWMPH1_PH4_SIZE                          equ 0001h
PWMPH1_PH4_LENGTH                        equ 0001h
PWMPH1_PH4_MASK                          equ 0010h

// Register: PWMPH2
#define PWMPH2 PWMPH2
PWMPH2                                   equ 0114h
// bitfield definitions
PWMPH2_PH_POSN                           equ 0000h
PWMPH2_PH_POSITION                       equ 0000h
PWMPH2_PH_SIZE                           equ 0005h
PWMPH2_PH_LENGTH                         equ 0005h
PWMPH2_PH_MASK                           equ 001Fh
PWMPH2_C1EN_POSN                         equ 0005h
PWMPH2_C1EN_POSITION                     equ 0005h
PWMPH2_C1EN_SIZE                         equ 0001h
PWMPH2_C1EN_LENGTH                       equ 0001h
PWMPH2_C1EN_MASK                         equ 0020h
PWMPH2_C2EN_POSN                         equ 0006h
PWMPH2_C2EN_POSITION                     equ 0006h
PWMPH2_C2EN_SIZE                         equ 0001h
PWMPH2_C2EN_LENGTH                       equ 0001h
PWMPH2_C2EN_MASK                         equ 0040h
PWMPH2_POL_POSN                          equ 0007h
PWMPH2_POL_POSITION                      equ 0007h
PWMPH2_POL_SIZE                          equ 0001h
PWMPH2_POL_LENGTH                        equ 0001h
PWMPH2_POL_MASK                          equ 0080h
PWMPH2_PH0_POSN                          equ 0000h
PWMPH2_PH0_POSITION                      equ 0000h
PWMPH2_PH0_SIZE                          equ 0001h
PWMPH2_PH0_LENGTH                        equ 0001h
PWMPH2_PH0_MASK                          equ 0001h
PWMPH2_PH1_POSN                          equ 0001h
PWMPH2_PH1_POSITION                      equ 0001h
PWMPH2_PH1_SIZE                          equ 0001h
PWMPH2_PH1_LENGTH                        equ 0001h
PWMPH2_PH1_MASK                          equ 0002h
PWMPH2_PH2_POSN                          equ 0002h
PWMPH2_PH2_POSITION                      equ 0002h
PWMPH2_PH2_SIZE                          equ 0001h
PWMPH2_PH2_LENGTH                        equ 0001h
PWMPH2_PH2_MASK                          equ 0004h
PWMPH2_PH3_POSN                          equ 0003h
PWMPH2_PH3_POSITION                      equ 0003h
PWMPH2_PH3_SIZE                          equ 0001h
PWMPH2_PH3_LENGTH                        equ 0001h
PWMPH2_PH3_MASK                          equ 0008h
PWMPH2_PH4_POSN                          equ 0004h
PWMPH2_PH4_POSITION                      equ 0004h
PWMPH2_PH4_SIZE                          equ 0001h
PWMPH2_PH4_LENGTH                        equ 0001h
PWMPH2_PH4_MASK                          equ 0010h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0119h
// bitfield definitions
CM1CON0_C1CH_POSN                        equ 0000h
CM1CON0_C1CH_POSITION                    equ 0000h
CM1CON0_C1CH_SIZE                        equ 0002h
CM1CON0_C1CH_LENGTH                      equ 0002h
CM1CON0_C1CH_MASK                        equ 0003h
CM1CON0_C1R_POSN                         equ 0002h
CM1CON0_C1R_POSITION                     equ 0002h
CM1CON0_C1R_SIZE                         equ 0001h
CM1CON0_C1R_LENGTH                       equ 0001h
CM1CON0_C1R_MASK                         equ 0004h
CM1CON0_C1SP_POSN                        equ 0003h
CM1CON0_C1SP_POSITION                    equ 0003h
CM1CON0_C1SP_SIZE                        equ 0001h
CM1CON0_C1SP_LENGTH                      equ 0001h
CM1CON0_C1SP_MASK                        equ 0008h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OE_POSN                        equ 0005h
CM1CON0_C1OE_POSITION                    equ 0005h
CM1CON0_C1OE_SIZE                        equ 0001h
CM1CON0_C1OE_LENGTH                      equ 0001h
CM1CON0_C1OE_MASK                        equ 0020h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1ON_POSN                        equ 0007h
CM1CON0_C1ON_POSITION                    equ 0007h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0080h
CM1CON0_C1CH0_POSN                       equ 0000h
CM1CON0_C1CH0_POSITION                   equ 0000h
CM1CON0_C1CH0_SIZE                       equ 0001h
CM1CON0_C1CH0_LENGTH                     equ 0001h
CM1CON0_C1CH0_MASK                       equ 0001h
CM1CON0_C1CH1_POSN                       equ 0001h
CM1CON0_C1CH1_POSITION                   equ 0001h
CM1CON0_C1CH1_SIZE                       equ 0001h
CM1CON0_C1CH1_LENGTH                     equ 0001h
CM1CON0_C1CH1_MASK                       equ 0002h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 011Ah
// bitfield definitions
CM2CON0_C2CH_POSN                        equ 0000h
CM2CON0_C2CH_POSITION                    equ 0000h
CM2CON0_C2CH_SIZE                        equ 0002h
CM2CON0_C2CH_LENGTH                      equ 0002h
CM2CON0_C2CH_MASK                        equ 0003h
CM2CON0_C2R_POSN                         equ 0002h
CM2CON0_C2R_POSITION                     equ 0002h
CM2CON0_C2R_SIZE                         equ 0001h
CM2CON0_C2R_LENGTH                       equ 0001h
CM2CON0_C2R_MASK                         equ 0004h
CM2CON0_C2SP_POSN                        equ 0003h
CM2CON0_C2SP_POSITION                    equ 0003h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0008h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OE_POSN                        equ 0005h
CM2CON0_C2OE_POSITION                    equ 0005h
CM2CON0_C2OE_SIZE                        equ 0001h
CM2CON0_C2OE_LENGTH                      equ 0001h
CM2CON0_C2OE_MASK                        equ 0020h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h
CM2CON0_C2CH0_POSN                       equ 0000h
CM2CON0_C2CH0_POSITION                   equ 0000h
CM2CON0_C2CH0_SIZE                       equ 0001h
CM2CON0_C2CH0_LENGTH                     equ 0001h
CM2CON0_C2CH0_MASK                       equ 0001h
CM2CON0_C2CH1_POSN                       equ 0001h
CM2CON0_C2CH1_POSITION                   equ 0001h
CM2CON0_C2CH1_SIZE                       equ 0001h
CM2CON0_C2CH1_LENGTH                     equ 0001h
CM2CON0_C2CH1_MASK                       equ 0002h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 011Bh
// bitfield definitions
CM2CON1_C2SYNC_POSN                      equ 0000h
CM2CON1_C2SYNC_POSITION                  equ 0000h
CM2CON1_C2SYNC_SIZE                      equ 0001h
CM2CON1_C2SYNC_LENGTH                    equ 0001h
CM2CON1_C2SYNC_MASK                      equ 0001h
CM2CON1_T1GSS_POSN                       equ 0001h
CM2CON1_T1GSS_POSITION                   equ 0001h
CM2CON1_T1GSS_SIZE                       equ 0001h
CM2CON1_T1GSS_LENGTH                     equ 0001h
CM2CON1_T1GSS_MASK                       equ 0002h
CM2CON1_MC2OUT_POSN                      equ 0006h
CM2CON1_MC2OUT_POSITION                  equ 0006h
CM2CON1_MC2OUT_SIZE                      equ 0001h
CM2CON1_MC2OUT_LENGTH                    equ 0001h
CM2CON1_MC2OUT_MASK                      equ 0040h
CM2CON1_MC1OUT_POSN                      equ 0007h
CM2CON1_MC1OUT_POSITION                  equ 0007h
CM2CON1_MC1OUT_SIZE                      equ 0001h
CM2CON1_MC1OUT_LENGTH                    equ 0001h
CM2CON1_MC1OUT_MASK                      equ 0080h

